# -*- coding: UTF-8 -*-

'''
write for my database course
to generous many differnt datas automatically
'''
import random

# print(random.randint(0, 9))

familyName = ["赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许","何","吕","施","张","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎","鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐","费","廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常","乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","和","穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒","屈","项","祝","董","梁","杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭","梅","盛","林","刁","钟","徐","邱","骆","高","夏","蔡","田","樊","胡","凌","霍","虞","万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应","宗","丁","宣","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁","荀","羊","於","惠","甄","曲","家","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓","牧","隗","山","谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫","宁","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","景","詹","束","龙","叶","幸","司","韶","郜","黎","蓟","薄","印","宿","白","怀","蒲","邰","从","鄂","索","咸","籍","赖","卓","蔺","屠","蒙","池","乔","阴","鬱","胥","能","苍","双","闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉","宰","郦","雍","卻","璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","郏","浦","尚","农","温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习","宦","艾","鱼","容","向","古","易","慎","戈","廖","庾","终","暨","居","衡","步","都","耿","满","弘","匡","国","文","寇","广","禄","阙","东","欧","殳","沃","利","蔚","越","夔","隆","师","巩","厍","聂","晁","勾","敖","融","冷","訾","辛","阚","那","简","饶","空","曾","毋","沙","乜","养","鞠","须","丰","巢","关","蒯","相","查","后","荆","红","游竺","盖益","桓公","万俟","司马","上官","欧阳","夏侯","诸葛","闻人","东方","赫连","皇甫","尉迟","公羊","澹台","公冶","宗政","濮阳","淳于","单于","太叔","申屠","公孙","仲孙","轩辕","令狐","钟离","宇文","长孙","慕容","鲜于","闾丘","司徒","司空","丌官","司寇","仉督","子车","颛孙","端木","巫马","公西","漆雕","乐正","壤驷","公良","拓跋","夹谷","宰父","谷梁","晋楚","百里","东郭","南门","呼延","归海","羊舌","微生","岳帅","缑亢","况郈","有琴","梁丘","左丘","东门","西门","商牟","佘佴","伯赏","南宫","年爱","阳佟"]

FirstName = ["铎","铮","梓","一","九","汝","邦","竹","至","充","姣","展","露","熙","逦","湾","霄","辉","卿","晟","晓","罡","浩","景","珂","策","皓","栋","起","棠","登","越","五","","贤","明","渊","博","圆","霁","玥","恬","姝","嫣","春","夏","秋","东","晨","辰","幕","溪","席","银","德","天","灵","钟","亦","赤","橙","黄","绿","青","蓝","紫","靓","海","研","言","晏","炎","淼","乾","坤","恒","弘","斌","旭","光","星","平","秩","黎","逸","珺"]

def genName():
    return familyName[random.randint(0, len(familyName)-1)] + FirstName[random.randint(0, len(FirstName)-1)]+ FirstName[random.randint(0, len(FirstName)-1)]

###################################################################################

zhuanye = [
    {"SpNo":"01","Specialty":"计算机应用","ClsName":"计算机","ClsNOAl":"CS"},
    {"SpNo":"02","Specialty":"数学","ClsName":"数学","ClsNOAl":"MT"},
    {"SpNo":"03","Specialty":"物理","ClsName":"物理","ClsNOAl":"PH"},
    {"SpNo":"04","Specialty":"应用地理","ClsName":"地理","ClsNOAl":"GL"},
    {"SpNo":"05","Specialty":"经济学","ClsName":"经济","ClsNOAl":"AE"},
    {"SpNo":"06","Specialty":"资源与环境","ClsName":"地理","ClsNOAl":"PR"},
    {"SpNo":"07","Specialty":"法学","ClsName":"法律","ClsNOAl":"SL"},
    {"SpNo":"08","Specialty":"马克思哲学","ClsName":"马哲","ClsNOAl":"MP"},
    {"SpNo":"09","Specialty":"教育学","ClsName":"教育","ClsNOAl":"HE"},
    {"SpNo":"10","Specialty":"分析化学","ClsName":"化学","ClsNOAl":"AC"},
    {"SpNo":"11","Specialty":"海洋科学","ClsName":"海洋","ClsNOAl":"MS"},
    {"SpNo":"12","Specialty":"地质学","ClsName":"地质","ClsNOAl":"GS"},
    {"SpNo":"13","Specialty":"机械工程","ClsName":"机械","ClsNOAl":"ME"},
    {"SpNo":"14","Specialty":"车辆工程","ClsName":"车辆","ClsNOAl":"VE"},
    {"SpNo":"15","Specialty":"仪器科学","ClsName":"仪器","ClsNOAl":"IS"},
    {"SpNo":"16","Specialty":"材料科学","ClsName":"材料","ClsNOAl":"MA"},
    {"SpNo":"17","Specialty":"电气工程","ClsName":"电气","ClsNOAl":"EE"},
    {"SpNo":"18","Specialty":"系统工程","ClsName":"系统","ClsNOAl":"SE"},
    {"SpNo":"19","Specialty":"土木工程","ClsName":"土木","ClsNOAl":"CE"},
    {"SpNo":"20","Specialty":"纺织工程","ClsName":"纺织","ClsNOAl":"TE"},
    {"SpNo":"21","Specialty":"生物工程","ClsName":"生物","ClsNOAl":"BE"},
    {"SpNo":"22","Specialty":"通信工程","ClsName":"通信","ClsNOAl":"CI"}
]

#############################################################3333

#######################################################################3
luname = ["长江","中央","合作","红星","青松","清逸","长宫","展利","希望","阳光","长虹","幸福","五河","明月","晴空"]
lu = ["路","街","坊","区","乡"]
shi = ["郑州市","洛阳市","焦作市","商丘市","信阳市","周口市","鹤壁市","安阳市","濮阳市","南阳市","开封市","漯河市","许昌市","新乡市","济源市","灵宝市","偃师市","邓州市","登封市","新郑市","禹州市","巩义市","永城市","长葛市","义马市","林州市","项城市","汝州市","荥阳市","合肥市","亳州市","芜湖市","池州市","黄山市","滁州市","安庆市","淮南市","淮北市","蚌埠市","宿州市","宣城市","六安市","阜阳市","铜陵市","明光市","天长市","宁国市","界首市","桐城市","潜山市","福州市","厦门市","泉州市","漳州市","南平市","三明市","龙岩市","龙海市","建瓯市","长乐市","福清市","晋江市","南安市","福安市","邵武市","石狮市","福鼎市","建阳市","漳平市","永安市","兰州市","白银市","武威市","金昌市","平凉市","张掖市","酒泉市","庆阳市","定西市","陇南市","天水市","玉门市","临夏市","合作市","敦煌市","甘南州","贵阳市","安顺市","遵义市","兴义市","都匀市","凯里市","毕节市","清镇市","铜仁市","赤水市","仁怀市","福泉市","海口市","三亚市","万宁市","文昌市","儋州市","琼海市","东方市","保定市","唐山市","沧州市","衡水市","廊坊市","承德市","迁安市","南宫市","任丘市","叶城市","辛集市","涿州市","定州市","晋州市","霸州市","伊春市","牡丹江","大庆市","鸡西市","鹤岗市","绥化市","黑河市","富锦市","虎林市","密山市","海林市","铁力市","北安市","海伦市","宁安市","讷河市","穆棱市","同江市","肇东市","武汉市","荆门市","咸宁市","襄阳市","荆州市","黄石市","宜昌市","随州市","鄂州市","孝感市","黄冈市","十堰市","枣阳市","恩施市","仙桃市","天门市","钟祥市","潜江市","麻城市","洪湖市","汉川市","赤壁市","松滋市","武穴市","广水市","枝江市","应城市","宜城市","当阳市","安陆市","宜都市","利川市","长沙市","郴州市","益阳市","娄底市","株洲市","衡阳市","湘潭市","岳阳市","常德市","邵阳市","永州市","怀化市","浏阳市","醴陵市","湘乡市","耒阳市","沅江市","涟源市","常宁市","吉首市","津市市","临湘市","汨罗市","武冈市","韶山市","湘西州","长春市","吉林市","通化市","白城市","四平市","辽源市","松原市","白山市","集安市","双辽市","延吉市","九台市","桦甸市","榆树市","蛟河市","磐石市","大安市","德惠市","洮南市","龙井市","珲春市","图们市","舒兰市","和龙市","临江市","敦化市","南京市","无锡市","常州市","扬州市","徐州市","苏州市","盐城市","淮安市","宿迁市","镇江市","南通市","泰州市","兴化市","东台市","常熟市","江阴市","通州市","宜兴市","邳州市","海门市","溧阳市","泰兴市","如皋市","昆山市","启东市","江都市","丹阳市","吴江市","靖江市","扬中市","新沂市","仪征市","太仓市","姜堰市","高邮市","金坛市","句容市","灌南县","南昌市","赣州市","上饶市","宜春市","新余市","九江市","萍乡市","抚州市","鹰潭市","吉安市","丰城市","樟树市","德兴市","瑞金市","高安市","乐平市","南康市","贵溪市","瑞昌市","东乡县","广丰县","信州区","三清山","沈阳市","大连市","盘锦市","鞍山市","铁岭市","本溪市","丹东市","抚顺市","锦州市","辽阳市","阜新市","朝阳市","海城市","北票市","盖州市","凤城市","庄河市","凌源市","开原市","兴城市","新民市","东港市","北宁市","凌海市","灯塔市","营口市","西宁市","济南市","青岛市","威海市","潍坊市","菏泽市","济宁市","东营市","烟台市","淄博市","枣庄市","泰安市","临沂市","日照市","德州市","聊城市","滨州市","乐陵市","兖州市","诸城市","邹城市","滕州市","肥城市","新泰市","胶州市","胶南市","即墨市","龙口市","平度市","莱西市","太原市","大同市","阳泉市","长治市","临汾市","晋中市","运城市","忻州市","朔州市","吕梁市","古交市","高平市","永济市","孝义市","侯马市","霍州市","介休市","河津市","汾阳市","原平市","晋城市","潞城市","西安市","咸阳市","榆林市","宝鸡市","铜川市","渭南市","汉中市","安康市","商洛市","延安市","韩城市","兴平市","华阴市","成都市","广安市","德阳市","乐山市","巴中市","内江市","宜宾市","南充市","自贡市","泸州市","广元市","达州市","资阳市","绵阳市","眉山市","遂宁市","雅安市","阆中市","广汉市","绵竹市","万源市","华蓥市","江油市","西昌市","彭州市","简阳市","崇州市","什邡市","邛崃市","双流县","昆明市","玉溪市","大理市","曲靖市","昭通市","保山市","丽江市","临沧市","楚雄市","开远市","个旧市","景洪市","安宁市","宣威市","杭州市","宁波市","绍兴市","温州市","台州市","湖州市","嘉兴市","金华市","舟山市","衢州市","丽水市","余姚市","乐清市","临海市","温岭市","永康市","瑞安市","慈溪市","义乌市","上虞市","诸暨市","海宁市","桐乡市","兰溪市","龙泉市","建德市","富德市","富阳市","平湖市","东阳市","嵊州市","奉化市","临安市","江山市","广州市","深圳市","珠海市","汕头市","佛山市","韶关市","湛江市","肇庆市","江门市","茂名市","惠州市","梅州市","汕尾市","河源市","阳江市","清远市","东莞市","中山市","潮州市","揭阳市","云浮市","贵港市","河池市","崇左市","来宾市","东兴市","桂平市","北流市","南宁市","贺州市","玉林市","桂林市","柳州市","梧州市","北海市","钦州市","百色市","岑溪市","合山市","凭祥市","宜州市","包头市","乌海市","银川市","固原市","中卫市","吴忠市","灵武市","哈密市","昌吉市","奎屯市","米泉市","和田市","香港","澳门"]

def Add():
    return shi[random.randint(0,len(shi)-1)]+luname[random.randint(0,len(luname)-1)] + lu[random.randint(0,len(lu)-1)]

###################################################################################
year = '2018'

sex = ['男','女']

#############################################################
course = [
    {"cname": "高等数学",    "cno": "0001", "cpno":"",                "credit":"6"},
    {"cname": "线性代数",    "cno": "0002", "cpno":"0001",         "credit": "2.5"},
    {"cname": "计算机基础",  "cno": "0003", "cpno": "",               "credit": "3"},
    {"cname": "英语",       "cno": "0004", "cpno": "",                "credit": "2.5"},
    {"cname": "法语",       "cno": "0005", "cpno": "0004",          "credit": "1.5"},
    {"cname": "马克思主义",  "cno": "0006", "cpno": "",                "credit": "3"},
    {"cname": "物理",       "cno": "0007", "cpno": "0001",          "credit": "4"},
    {"cname": "毛泽东概论",  "cno": "0008", "cpno": "0006",          "credit": "3"},
    {"cname": "现代史",     "cno": "0009", "cpno": "0008",  "credit": "2"},
    {"cname": "物理实验",   "cno": "0010", "cpno": "0007",           "credit": "1.5"},
    {"cname": "大学体育",   "cno": "0011", "cpno": "",                  "credit": "1"},
    {"cname": "概率论",     "cno": "0012", "cpno":  "0002",   "credit": "3.5"},
    {"cname": "数值分析",   "cno": "0013", "cpno": "0002",    "credit": "2"},
    {"cname": "程序设计",   "cno": "0014", "cpno": "0003",           "credit": "4"}
]


file_class = 'class.txt'
file_student = 'student.txt'
file_course = 'course.txt'
file_sc = 'sc.txt'

def main():
    fclass= open(file_class,"w+")
    fstudent= open(file_student,"w+")
    fcourse= open(file_course ,"w+")
    fsc= open(file_sc,"w+")
    # 遍历专业 -》 遍历班级 -》 遍历学生

    for i in range(0,len(course)):
        cno = course[i]['cno']
        cname = course[i]['cname']
        cpno = course[i]['cpno']
        credit = course[i]['credit']
        fcourse.write(cno+","+cname+","+cpno+","+credit+"\n")


    for i in range(0,len(zhuanye)):
        num = -1
        teacher = []
        t1 = genName()
        t2 = genName()
        teacher.append(t1)
        teacher.append(t2)
        teacher.append(genName())
        for j in range(0,5):# 每个专业5个班
            clsno = zhuanye[i]['ClsNOAl'] + str(j + 1).zfill(2)
            if(j+1 == 1):
                n = '一班'
            elif(j+1 == 2):
                n = '二班'
            elif (j + 1 == 3):
                n = '三班'
            elif (j + 1 == 4):
                n = '四班'
            else:
                n = '五班'
            classname = zhuanye[i]['ClsName'] + n
            spa = zhuanye[i]['Specialty']
            tea = teacher[random.randint(0,len(teacher)-1)]
            fclass.write(clsno + "," + classname +","+ tea +","+ spa+"\n")



            for k in range(0,18): #每个班19位学生
                num += 1
                name = genName()
                sno = year + zhuanye[i]['SpNo'] + str(num).zfill(2)
                ssex = sex[random.randint(0,len(sex)-1)]

                sadd = Add()
                sage = str(random.randint(17,21))
                if ssex=='女':
                    sheight = str(format((1.65 + random.randint(-15,30)/100),'.2f'))
                else:
                    sheight = str(format((1.7 + random.randint(-20, 35)/100),'.2f'))

                cno1 = str(random.randint(0,len(course)))
                cno2 = str(random.randint(0,len(course)))
                while cno1 == cno2:
                    cno2 = str(random.randint(0, len(course)))
                grade1 = str(random.randint(50,99))
                grade2 = str(random.randint(50,99))

                fsc.write(sno+"," + cno1 +","+ grade1 +"\n")
                fsc.write(sno+"," + cno2 +","+ grade2 +"\n")

                fstudent.write(sno + ","+name +","+ssex+","+clsno+","+sadd+","+sage+","+sheight+"\n")

if __name__ == '__main__':
    main()